export const mockOrder = {
  trackNumber: "AT7749",
  customer: "Александр Максимович Д.",
  totalValue: 10000,
  products: [
    { id: 40, label: "Шпажки прозрачные", price: 100, count: 10 },
    {
      id: 44,
      label: "Стелья плетеные",
      price: 2000,
      count: 2,
    },
    { id: 56, label: "Ледогенератор", price: 5000, count: 1 },
  ],
  description: null,
  statuses: {
    currentStatus: "Новый заказ",
    historyStatuses: [
      {
        status: "Новый заказ",
        date: "2025-02-27T17:49:33+03:00",
      },
      { status: "Оплачен клиентом", date: "2025-03-03T18:37:44+03:00" },
      {
        status: "Оплачен в обработке",
        date: "2025-03-03T18:37:45+03:00",
      },
      {
        status: "В доставке на склад в Китае",
        date: "2025-03-03T18:37:53+03:00",
      },
      { status: "Частично на складе", date: "2025-03-03T18:37:54+03:00" },
      {
        status: "На складе",
        date: "2025-03-03T18:37:59+03:00",
      },
      {
        status: "В доставке в РФ (Москва)",
        date: "2025-03-03T18:38:00+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-11T15:37:34+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T15:46:29+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-11T15:47:17+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T15:47:20+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-11T15:51:11+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T15:51:12+03:00",
      },
      { status: "Новый заказ", date: "2025-03-11T20:44:07+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T20:44:09+03:00",
      },
      { status: "Частично на складе", date: "2025-03-11T20:44:42+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T20:45:15+03:00",
      },
      { status: "Новый заказ", date: "2025-03-11T20:46:15+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-11T20:46:21+03:00",
      },
      { status: "Частично на складе", date: "2025-03-11T20:46:37+03:00" },
      {
        status: "В доставке в РФ (Москва)",
        date: "2025-03-11T20:46:53+03:00",
      },
      { status: "В доставке по РФ", date: "2025-03-11T20:47:05+03:00" },
      {
        status: "Новый заказ",
        date: "2025-03-11T20:47:19+03:00",
      },
      { status: "Оплачен клиентом", date: "2025-03-11T21:03:17+03:00" },
      {
        status: "Частично на складе",
        date: "2025-03-11T21:03:37+03:00",
      },
      { status: "В доставке по РФ", date: "2025-03-11T21:03:52+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-12T13:47:40+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-12T14:09:00+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-12T14:09:43+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-12T14:11:41+03:00" },
      {
        status: "Оплачен клиентом",
        date: "2025-03-12T14:14:04+03:00",
      },
      { status: "Оплачен в обработке", date: "2025-03-12T14:14:32+03:00" },
      {
        status: "Новый заказ",
        date: "2025-03-12T14:14:38+03:00",
      },
    ],
  },
};
